In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
df.shape

(244, 7)

In [5]:
#missing data Treatments
# 1. Bool missing / not missing
# 2. count null values
# 3. depending on that replace or remove

In [36]:
df2 = pd.DataFrame({'A':[1,4,np.nan,np.nan],'B':[2,np.nan,np.nan,np.nan],'C':[3,6,9,np.nan]})
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  NaN  9.0
3  NaN  NaN  NaN

In [17]:
df2.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3   True   True   True

In [18]:
df2.notnull()

       A      B      C
0   True   True   True
1   True  False   True
2  False  False   True
3  False  False  False

In [22]:
df2.isnull().sum()

A    2
B    3
C    1
dtype: int64

In [23]:
df2.dropna(how='all')

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  NaN  9.0

In [24]:
df2.dropna(thresh=1)

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  NaN  9.0

In [26]:
df2.dropna(thresh=2)

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0

In [37]:
df2['C'] = df2['C'].fillna(df2['C'].mean())
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  NaN  9.0
3  NaN  NaN  6.0

In [49]:
df2.dropna(subset=['A'])

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0

In [50]:
df3 = pd.DataFrame({'Col1':['A','A','A','B','B'],'Col2':[10,10,20,20,20]})
df3

  Col1  Col2
0    A    10
1    A    10
2    A    20
3    B    20
4    B    20

In [51]:
df3.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [52]:
df3.duplicated(keep='last')

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [54]:
df3.duplicated(keep=False)

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [55]:
df3.drop_duplicates()

  Col1  Col2
0    A    10
2    A    20
3    B    20

In [56]:
df3.drop_duplicates(keep='last')

  Col1  Col2
1    A    10
2    A    20
4    B    20

In [57]:
df3.drop_duplicates(keep=False)

  Col1  Col2
2    A    20

In [58]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [59]:
df.isnull().sum()  #no null values

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [65]:
df[df.duplicated()==True]

     total_bill  tip     sex smoker   day   time  size
202        13.0  2.0  Female    Yes  Thur  Lunch     2

In [66]:
df[df.duplicated(keep='last')==True]

     total_bill  tip     sex smoker   day   time  size
198        13.0  2.0  Female    Yes  Thur  Lunch     2

In [70]:
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [74]:
df.nunique()

total_bill    229
tip           123
sex             2
smoker          2
day             4
time            2
size            6
dtype: int64

In [77]:
df['day'].unique()

[Sun, Sat, Thur, Fri]
Categories (4, object): [Sun, Sat, Thur, Fri]

In [79]:
df['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64